# Anlysis Country in Southeast Asia

In [1]:
%load_ext sql

In [2]:
#mysql://user_name:password@localhost/database
mysql_con = 'mysql://root:S|kamaru21@localhost/world'

In [3]:
#%sql $mysql_con quarry
%sql $mysql_con show tables

3 rows affected.

[('city',), ('country',), ('countrylanguage',)]

In [4]:
# Table City
%sql $mysql_con \
    SELECT * FROM city LIMIT 5

5 rows affected.

[(1, 'Kabul', 'AFG', 'Kabol', 1780000),
 (2, 'Qandahar', 'AFG', 'Qandahar', 237500),
 (3, 'Herat', 'AFG', 'Herat', 186800),
 (4, 'Mazar-e-Sharif', 'AFG', 'Balkh', 127800),
 (5, 'Amsterdam', 'NLD', 'Noord-Holland', 731200)]

In [5]:
# Table Country
%sql $mysql_con \
    SELECT * FROM country LIMIT 5

5 rows affected.

[('ABW', 'Aruba', 'North America', 'Caribbean', 193.0, None, 103000, 78.4, 828.0, 793.0, 'Aruba', 'Nonmetropolitan Territory of The Netherlands', 'Beatrix', 129, 'AW'),
 ('AFG', 'Afghanistan', 'Asia', 'Southern and Central Asia', 652090.0, 1919, 22720000, 45.9, 5976.0, None, 'Afganistan/Afqanestan', 'Islamic Emirate', 'Mohammad Omar', 1, 'AF'),
 ('AGO', 'Angola', 'Africa', 'Central Africa', 1246700.0, 1975, 12878000, 38.3, 6648.0, 7984.0, 'Angola', 'Republic', 'JosÃ© Eduardo dos Santos', 56, 'AO'),
 ('AIA', 'Anguilla', 'North America', 'Caribbean', 96.0, None, 8000, 76.1, 63.2, None, 'Anguilla', 'Dependent Territory of the UK', 'Elisabeth II', 62, 'AI'),
 ('ALB', 'Albania', 'Europe', 'Southern Europe', 28748.0, 1912, 3401200, 71.6, 3205.0, 2500.0, 'ShqipÃ«ria', 'Republic', 'Rexhep Mejdani', 34, 'AL')]

In [6]:
# Table countrylanguage
%sql $mysql_con \
    SELECT * FROM countrylanguage LIMIT 5

5 rows affected.

[('ABW', 'Dutch', 'T', 5.3),
 ('ABW', 'English', 'F', 9.5),
 ('ABW', 'Papiamento', 'F', 76.7),
 ('ABW', 'Spanish', 'F', 7.4),
 ('AFG', 'Balochi', 'F', 0.9)]

## Total Country From Continent Asia

In [7]:
%sql $mysql_con \
    SELECT count(*) FROM country WHERE continent = 'Asia'

1 rows affected.

[(51,)]

In [8]:
# Country in ASIA Any Region
%sql $mysql_con \
    SELECT count(code), Region FROM country WHERE continent = 'Asia' group by Region

4 rows affected.

[(14, 'Southern and Central Asia'),
 (18, 'Middle East'),
 (11, 'Southeast Asia'),
 (8, 'Eastern Asia')]

# Country From Southeast Asia

In [9]:
%sql $mysql_con \
    SELECT * FROM country WHERE Region = 'Southeast Asia'

11 rows affected.

[('BRN', 'Brunei', 'Asia', 'Southeast Asia', 5765.0, 1984, 328000, 73.6, 11705.0, 12460.0, 'Brunei Darussalam', 'Monarchy (Sultanate)', 'Haji Hassan al-Bolkiah', 538, 'BN'),
 ('IDN', 'Indonesia', 'Asia', 'Southeast Asia', 1904569.0, 1945, 212107000, 68.0, 84982.0, 215002.0, 'Indonesia', 'Republic', 'Abdurrahman Wahid', 939, 'ID'),
 ('KHM', 'Cambodia', 'Asia', 'Southeast Asia', 181035.0, 1953, 11168000, 56.5, 5121.0, 5670.0, 'KÃ¢mpuchÃ©a', 'Constitutional Monarchy', 'Norodom Sihanouk', 1800, 'KH'),
 ('LAO', 'Laos', 'Asia', 'Southeast Asia', 236800.0, 1953, 5433000, 53.1, 1292.0, 1746.0, 'Lao', 'Republic', 'Khamtay Siphandone', 2432, 'LA'),
 ('MMR', 'Myanmar', 'Asia', 'Southeast Asia', 676578.0, 1948, 45611000, 54.9, 180375.0, 171028.0, 'Myanma Pye', 'Republic', 'kenraali Than Shwe', 2710, 'MM'),
 ('MYS', 'Malaysia', 'Asia', 'Southeast Asia', 329758.0, 1957, 22244000, 70.8, 69213.0, 97884.0, 'Malaysia', 'Constitutional Monarchy, Federation', 'Salahuddin Abdul Aziz Shah Alhaj', 2464, 'MY'),
 ('PHL', 'Philippines', 'Asia', 'Southeast Asia', 300000.0, 1946, 75967000, 67.5, 65107.0, 82239.0, 'Pilipinas', 'Republic', 'Gloria Macapagal-Arroyo', 766, 'PH'),
 ('SGP', 'Singapore', 'Asia', 'Southeast Asia', 618.0, 1965, 3567000, 80.1, 86503.0, 96318.0, 'Singapore/Singapura/Xinjiapo/Singapur', 'Republic', 'Sellapan Rama Nathan', 3208, 'SG'),
 ('THA', 'Thailand', 'Asia', 'Southeast Asia', 513115.0, 1350, 61399000, 68.6, 116416.0, 153907.0, 'Prathet Thai', 'Constitutional Monarchy', 'Bhumibol Adulyadej', 3320, 'TH'),
 ('TMP', 'East Timor', 'Asia', 'Southeast Asia', 14874.0, None, 885000, 46.0, 0.0, None, 'Timor Timur', 'Administrated by the UN', 'JosÃ© Alexandre GusmÃ£o', 1522, 'TP'),
 ('VNM', 'Vietnam', 'Asia', 'Southeast Asia', 331689.0, 1945, 79832000, 69.3, 21929.0, 22834.0, 'ViÃªt Nam', 'Socialistic Republic', 'TrÃ¢n Duc Luong', 3770, 'VN')]

In [10]:
# Gruoping SurfaceArea and Population
%sql $mysql_con \
    SELECT Name, SurfaceArea, Population\
        FROM country WHERE Region = 'Southeast Asia' ORDER BY SurfaceArea Desc

11 rows affected.

[('Indonesia', 1904569.0, 212107000),
 ('Myanmar', 676578.0, 45611000),
 ('Thailand', 513115.0, 61399000),
 ('Vietnam', 331689.0, 79832000),
 ('Malaysia', 329758.0, 22244000),
 ('Philippines', 300000.0, 75967000),
 ('Laos', 236800.0, 5433000),
 ('Cambodia', 181035.0, 11168000),
 ('East Timor', 14874.0, 885000),
 ('Brunei', 5765.0, 328000),
 ('Singapore', 618.0, 3567000)]

Indonesia is the biggest Area and Population in Southeast Asia

In [11]:
# Average SurfaceArea and Population 
%sql $mysql_con \
    SELECT AVG(SurfaceArea) AS AVG_Area, AVG(Population) AS AVF_Pop\
        FROM country WHERE Region = 'Southeast Asia'

1 rows affected.

[(408618.272727, Decimal('47140090.9091'))]

In [12]:
# The Area and Populatin in Southeast Asia with upper than Average
%sql $mysql_con \
    SELECT Name, SurfaceArea, Population\
        FROM country \
            WHERE Region = 'Southeast Asia' AND SurfaceArea > (SELECT AVG(SurfaceArea) FROM country WHERE Region = 'Southeast Asia') \
                AND Population >(SELECT AVG(Population) FROM country WHERE Region = 'Southeast Asia')

2 rows affected.

[('Indonesia', 1904569.0, 212107000), ('Thailand', 513115.0, 61399000)]

In [73]:
# Indepandent Year
%sql $mysql_con \
    SELECT Name, IndepYear\
        FROM country \
            WHERE Region = 'Southeast Asia' ORDER BY IndepYear Asc

11 rows affected.

[('East Timor', None),
 ('Thailand', 1350),
 ('Indonesia', 1945),
 ('Vietnam', 1945),
 ('Philippines', 1946),
 ('Myanmar', 1948),
 ('Cambodia', 1953),
 ('Laos', 1953),
 ('Malaysia', 1957),
 ('Singapore', 1965),
 ('Brunei', 1984)]

In [14]:
%sql $mysql_con \
    SELECT Name, GovernmentForm	\
        FROM country \
            WHERE Region = 'Southeast Asia' AND Name = 'East Timor'

1 rows affected.

[('East Timor', 'Administrated by the UN')]

East Timor has not Indepandent year because the geverment still Administrated by the UN

In [15]:
# Average of Life Expectancy in Southeast Asia
%sql $mysql_con \
    SELECT AVG(LifeExpectancy) AS AVG_LifeExpectanc\
        FROM country \
            WHERE Region = 'Southeast Asia'

1 rows affected.

[(64.4,)]

In [16]:
%sql $mysql_con \
    SELECT Name, LifeExpectancy\
        FROM country \
            WHERE Region = 'Southeast Asia' ORDER BY LifeExpectancy DESC

11 rows affected.

[('Singapore', 80.1),
 ('Brunei', 73.6),
 ('Malaysia', 70.8),
 ('Vietnam', 69.3),
 ('Thailand', 68.6),
 ('Indonesia', 68.0),
 ('Philippines', 67.5),
 ('Cambodia', 56.5),
 ('Myanmar', 54.9),
 ('Laos', 53.1),
 ('East Timor', 46.0)]

Singapore has the higher Life Expectacy in Southeast Asia

In [17]:
# The Lower GNP Country in Southeast Asia
%sql $mysql_con \
    SELECT Name, GNP AS MIN_GNP\
        FROM country \
            WHERE Region = 'Southeast Asia' AND GNP = (SELECT MIN(GNP) FROM country WHERE Region = 'Southeast Asia')

1 rows affected.

[('East Timor', 0.0)]

In [18]:
# The Biggest GNP Country in Southeast Asia
%sql $mysql_con \
    SELECT Name, GNP AS MAX_GNP\
        FROM country \
            WHERE Region = 'Southeast Asia' AND GNP = (SELECT MAX(GNP) FROM country WHERE Region = 'Southeast Asia')

1 rows affected.

[('Myanmar', 180375.0)]

In [19]:
# The Average GNP Country in Southeast Asia
%sql $mysql_con \
    SELECT AVG(GNP) AS AVG_GNP\
        FROM country \
            WHERE Region = 'Southeast Asia'

1 rows affected.

[(58422.090909,)]

In [20]:
#Country with GNF Upper than Average
%sql $mysql_con \
    SELECT Name, GNP\
        FROM country \
            WHERE Region = 'Southeast Asia' AND GNP > (SELECT AVG(GNP) FROM country WHERE Region = 'Southeast Asia')\
                ORDER BY GNP DESC

6 rows affected.

[('Myanmar', 180375.0),
 ('Thailand', 116416.0),
 ('Singapore', 86503.0),
 ('Indonesia', 84982.0),
 ('Malaysia', 69213.0),
 ('Philippines', 65107.0)]

In [21]:
# GNP PER CAPITAL
%sql $mysql_con \
    SELECT Name, GNP/Population AS GNP_Percapital\
        FROM country \
            WHERE Region = 'Southeast Asia' GROUP BY Name ORDER BY GNP_Percapital DESC

11 rows affected.

[('Brunei', 0.035686),
 ('Singapore', 0.024251),
 ('Myanmar', 0.003955),
 ('Malaysia', 0.003112),
 ('Thailand', 0.001896),
 ('Philippines', 0.000857),
 ('Cambodia', 0.000459),
 ('Indonesia', 0.000401),
 ('Vietnam', 0.000275),
 ('Laos', 0.000238),
 ('East Timor', 0.0)]

Brunei has the biggest GNP PER CAPITAL in southeast asia

In [22]:
# Goverment Form in Southeast Asia
%sql $mysql_con \
    SELECT GovernmentForm, count(Code) AS Total\
        FROM country \
            WHERE Region = 'Southeast Asia' GROUP BY GovernmentForm ORDER BY Total DESC

6 rows affected.

[('Republic', 5),
 ('Constitutional Monarchy', 2),
 ('Monarchy (Sultanate)', 1),
 ('Constitutional Monarchy, Federation', 1),
 ('Administrated by the UN', 1),
 ('Socialistic Republic', 1)]

In [36]:
# Total languages uses in any country 
%sql $mysql_con \
    WITH CTE AS (SELECT *\
        FROM country \
            WHERE Region = 'Southeast Asia')\
    SELECT a.Name, Count(b.Language) AS Total_Language FROM CTE a INNER JOIN countrylanguage b \
        ON a.Code = b.CountryCode\
            GROUP BY Name ORDER BY 2 DESC

11 rows affected.

[('Philippines', 10),
 ('Indonesia', 9),
 ('Vietnam', 9),
 ('Myanmar', 8),
 ('Malaysia', 6),
 ('Thailand', 6),
 ('Brunei', 4),
 ('Cambodia', 4),
 ('Laos', 4),
 ('Singapore', 3),
 ('East Timor', 2)]

In [38]:
# Offical Language in any country
%sql $mysql_con \
    WITH CTE AS (SELECT *\
        FROM country \
            WHERE Region = 'Southeast Asia')\
    SELECT a.Name, b.Language AS Offical_Language FROM CTE a \
        INNER JOIN countrylanguage b ON a.Code = b.CountryCode\
            WHERE b.IsOfficial = 'T' GROUP BY Name ORDER BY 1 ASC

11 rows affected.

[('Brunei', 'Malay'),
 ('Cambodia', 'Khmer'),
 ('East Timor', 'Portuguese'),
 ('Indonesia', 'Malay'),
 ('Laos', 'Lao'),
 ('Malaysia', 'Malay'),
 ('Myanmar', 'Burmese'),
 ('Philippines', 'Pilipino'),
 ('Singapore', 'Chinese'),
 ('Thailand', 'Thai'),
 ('Vietnam', 'Vietnamese')]